sdrgeek/OpenRTX/platform/mcu/CMSIS/Device/GD/GD32F3xx/Include/gd32f303xx.h
#define FLASH_BASE            0x08000000UL /*!< FLASH base address in the alias region */
#define SRAM_BASE             0x20000000UL /*!< SRAM base address in the alias region */
#define PERIPH_BASE           0x40000000UL /*!< Peripheral base address in the alias region */


/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00018000UL)

/*!< APB1 peripherals */
#define TIM1_BASE             (APB1PERIPH_BASE + 0x00000000UL)
#define TIM2_BASE             (APB1PERIPH_BASE + 0x00000400UL)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x00000800UL)
#define TIM4_BASE             (APB1PERIPH_BASE + 0x00000C00UL)
#define TIM5_BASE             (APB1PERIPH_BASE + 0x00001000UL)
#define TIM6_BASE             (APB1PERIPH_BASE + 0x00001400UL)
#define TIM11_BASE            (APB1PERIPH_BASE + 0x00001800UL)
#define TIM12_BASE            (APB1PERIPH_BASE + 0x00001C00UL)
#define TIM13_BASE            (APB1PERIPH_BASE + 0x00002000UL)
#define RTC_BASE              (APB1PERIPH_BASE + 0x00002800UL)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x00002C00UL)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x00003000UL)
#define SPI1_BASE             (APB1PERIPH_BASE + 0x00003800UL)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x00003C00UL)
#define USART1_BASE           (APB1PERIPH_BASE + 0x00004400UL)
#define USART2_BASE           (APB1PERIPH_BASE + 0x00004800UL)
#define UART3_BASE            (APB1PERIPH_BASE + 0x00004C00UL)
#define UART4_BASE            (APB1PERIPH_BASE + 0x00005000UL)
#define I2C0_BASE             (APB1PERIPH_BASE + 0x00005400UL)
#define I2C1_BASE             (APB1PERIPH_BASE + 0x00005800UL)
#define USB_BASE              (APB1PERIPH_BASE + 0x00005C00UL) /*!< USB_IP Peripheral Registers base address */
#define USB_PMAADDR           (APB1PERIPH_BASE + 0x00006000UL) /*!< USB_IP Packet Memory Area base address */
#define CAN0_BASE             (APB1PERIPH_BASE + 0x00006400UL)
#define BKP_BASE              (APB1PERIPH_BASE + 0x00006C00UL)
#define PWR_BASE              (APB1PERIPH_BASE + 0x00007000UL)
#define DAC0_BASE             (APB1PERIPH_BASE + 0x00007400UL)
#define DAC_BASE               DAC1_BASE
#define CTC_BASE              (APB1PERIPH_BASE + 0x0000C800UL)

/*!< APB2 peripherals */
#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x00000000UL)
#define EXTI_BASE             (APB2PERIPH_BASE + 0x00000400UL)
#define GPIOA_BASE            (APB2PERIPH_BASE + 0x00000800UL)
#define GPIOB_BASE            (APB2PERIPH_BASE + 0x00000C00UL)
#define GPIOC_BASE            (APB2PERIPH_BASE + 0x00001000UL)
#define GPIOD_BASE            (APB2PERIPH_BASE + 0x00001400UL)
#define GPIOE_BASE            (APB2PERIPH_BASE + 0x00001800UL)
#define GPIOF_BASE            (APB2PERIPH_BASE + 0x00001C00UL)
#define GPIOG_BASE            (APB2PERIPH_BASE + 0x00002000UL)
#define ADC0_BASE             (APB2PERIPH_BASE + 0x00002400UL)
#define ADC1_BASE             (APB2PERIPH_BASE + 0x00002800UL)
#define TIM0_BASE             (APB2PERIPH_BASE + 0x00002C00UL)
#define SPI0_BASE             (APB2PERIPH_BASE + 0x00003000UL)
#define TIM7_BASE             (APB2PERIPH_BASE + 0x00003400UL)
#define USART0_BASE           (APB2PERIPH_BASE + 0x00003800UL)
#define ADC2_BASE             (APB2PERIPH_BASE + 0x00003C00UL)
#define TIM8_BASE             (APB2PERIPH_BASE + 0x00004C00UL)
#define TIM9_BASE             (APB2PERIPH_BASE + 0x00005000UL)
#define TIM10_BASE            (APB2PERIPH_BASE + 0x00005400UL)

/*!< AHB1 peripherals */
#define SDIO_BASE             (AHB1PERIPH_BASE + 0x00000000UL)
#define DMA0_BASE             (AHB1PERIPH_BASE + 0x00002000UL)
#define DMA1_BASE             (AHB1PERIPH_BASE + 0x00002400UL)
#define RCC_BASE              (AHB1PERIPH_BASE + 0x00003000UL)
#define FMC_BASE              (AHB1PERIPH_BASE + 0x00004000UL) /*!< Flash registers base address */
#define CRC_BASE              (AHB1PERIPH_BASE + 0x00005000UL)

/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */
#define TIM1                ((TIM_TypeDef *) TIM1_BASE)
#define TIM2                ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                ((TIM_TypeDef *) TIM4_BASE)
#define TIM6                ((TIM_TypeDef *) TIM6_BASE)
#define TIM11               ((TIM_TypeDef *) TIM11_BASE)
#define TIM12               ((TIM_TypeDef *) TIM12_BASE)
#define TIM13               ((TIM_TypeDef *) TIM13_BASE)
#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define WWDG                ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                ((IWDG_TypeDef *) IWDG_BASE)
#define SPI1                ((SPI_TypeDef *) SPI1_BASE)
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define USART1              ((USART_TypeDef *) USART1_BASE)
#define USART2              ((USART_TypeDef *) USART2_BASE)
#define UART3               ((USART_TypeDef *) UART3_BASE)
#define UART4               ((USART_TypeDef *) UART4_BASE)
#define I2C0                ((I2C_TypeDef *) I2C0_BASE)
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#define CAN0                ((CAN_TypeDef *) CAN0_BASE)
#define PWR                 ((PWR_TypeDef *) PWR_BASE)
#define SYSCFG              ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define EXTI                ((EXTI_TypeDef *) EXTI_BASE)
#define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD               ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE               ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF               ((GPIO_TypeDef *) GPIOF_BASE)
#define GPIOG               ((GPIO_TypeDef *) GPIOG_BASE)
#define SPI1                ((SPI_TypeDef *) SPI1_BASE)
#define TIM8                ((TIM_TypeDef *) TIM8_BASE)
#define USART1              ((USART_TypeDef *) USART1_BASE)
#define ADC0                ((ADC_TypeDef *) ADC0_BASE)
#define ADC1                ((ADC_TypeDef *) ADC1_BASE)
#define TIM0                ((TIM_TypeDef *) TIM0_BASE)
#define SPI0                ((SPI_TypeDef *) SPI0_BASE)
#define TIM7                ((TIM_TypeDef *) TIM7_BASE)
#define USART0              ((USART_TypeDef *) USART0_BASE)
#define ADC2                ((ADC_TypeDef *) ADC2_BASE)
#define TIM8                ((TIM_TypeDef *) TIM8_BASE)
#define TIM9                ((TIM_TypeDef *) TIM9_BASE)
#define TIM10               ((TIM_TypeDef *) TIM10_BASE)
#define SDIO  // new
#define DMA0                ((DMA_TypeDef *) DMA0_BASE)
#define DMA1                ((DMA_TypeDef *) DMA1_BASE)
#define RCC                 ((RCC_TypeDef *) RCC_BASE)
#define FLASH               ((FLASH_TypeDef *) FMC_BASE)
#define CRC                 ((CRC_TypeDef *) CRC_BASE)

